//------------------------------------------------------------------------
// ファイル名 : Parse.h
// 概要      : 構文解析に関するヘッダーファイル
// 履歴      : 2019.7.17 平 大真 新規作成
//------------------------------------------------------------------------
//------------------------------------------------------------------------
// インクルードガード
//------------------------------------------------------------------------
#ifndef PARSE_H
#define	PARSE_H

//------------------------------------------------------------------------
// インクルード
//------------------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>
#include "List.h"
#include "Logger.h"

//------------------------------------------------------------------------
// プロトタイプ宣言                                           
//------------------------------------------------------------------------
int PreProcess(char* psToken[]);
TItem* MakeTree(char* psToken[]);
TItem* Formula(char* psToken[]);
TItem* Term(char* psToken[]);
TItem* Factor(char* psToken[]);
TItem* JoinNode(TItem* pkNode, TItem* pkLeftNode, TItem* pkRightNode);


#endif	/* PARSE_H */

